*> Randall Nagy - 12/01/2023 - Christmas Hapday.
*> cobc -x -j -free CHRISTMAS_2021.cob
*> (Yea, wellll ... justa 'possibility demo!  ;-)
*>
IDENTIFICATION DIVISION.
PROGRAM-ID. CHRISTMAS_2021.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
FUNCTION ALL INTRINSIC.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY WS_COLORS.
01 ANYKEY PIC X.

SCREEN SECTION.
01 ZSCREEN.
05 LINE 1 COLUMN 1 VALUE '* Season`s Greetings * 11/2023                                          ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 2 COLUMN 1 VALUE '      __,_,_,___)          _______                                      ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 3 COLUMN 1 VALUE '    (--| | |             (--/    ),_)        ,_)                        ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 4 COLUMN 1 VALUE '       | | |  _ ,_,_        |     |_ ,_ . , _|_,_,_, _  ,               ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 5 COLUMN 1 VALUE '     __| | | (/_| | (_|     |     | ||  |/_)_| | | |(_|/_)___,          ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 6 COLUMN 1 VALUE '    (      |___,   ,__|     \____)  |__,           |__,                 ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 7 COLUMN 1 VALUE '                                                                        ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 8 COLUMN 1 VALUE '                            |                         _...._            ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 9 COLUMN 1 VALUE '                         \  _  /                    .::o:::::.          ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 10 COLUMN 1 VALUE '                          (\o/)                    .:::....:o:.         ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 11 COLUMN 1 VALUE '                      ---  / \  ---                :o:_    _:::         ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 12 COLUMN 1 VALUE '                           >*<                     `:}_>()<_{:.         ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 13 COLUMN 1 VALUE '                          >0<@<                 @    `.//\\.`    @      ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 14 COLUMN 1 VALUE '                         >>>@<<*              @ #     //  \\     # @    ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 15 COLUMN 1 VALUE '                        >@>*<0<<<           __#_#____/.____.\____#_#__  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 16 COLUMN 1 VALUE '                       >*>>@<<<@<<         [__________________________] ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 17 COLUMN 1 VALUE '                      >@>>0<<<*<<@<         |=_- .-/\ /\ /\ /\--. =_-|  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 18 COLUMN 1 VALUE '                     >*>>0<<@<<<@<<<        |-_= | \ \\ \\ \\ \ |-_=-|  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 19 COLUMN 1 VALUE '                    >@>>*<<@<>*<<0<*<       |_=-=| / // // // / |_=-_|  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 20 COLUMN 1 VALUE '      \*/          >0>>*<<@<>0><<*<@<<      |=_- |`-.`-.`-.`-.  |=_=-|  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 21 COLUMN 1 VALUE '  ___\\U//___     >*>>@><0<<*>>@><*<0<<     | =_-| o          o |_==_|  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 22 COLUMN 1 VALUE '  |\\ | | \\|    >@>>0<*<<0>>@<<0<<<*<@<    |=_- | !     (    ! |=-_=|  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 23 COLUMN 1 VALUE '  | \\| | _(UU)_ >((*))_>0><*<0><@<<<0<*<  _|-,-=| !    ).    ! |-_-=|_ ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 24 COLUMN 1 VALUE '  |\ \| || / //||.*.*.*.|>>@<<*<<@>><0<<@</=-((=_| ! __(:.)__ ! |=_==_-\' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 25 COLUMN 1 VALUE '  |\\_|_|&&_// ||*.*.*.*|_\\db//__     (\_/)-=))-|/^\=^=^^=^=/^\| _=-_-_\' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 26 COLUMN 1 VALUE '  """"|......|~~|.*.*.*|     ____|_   =(...)=//   ,------------.        ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 27 COLUMN 1 VALUE '  jgs |......|   ^^^^^^|____|>>>>>>|  ( ~~~ )/   (((((((())))))))       ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 28 COLUMN 1 VALUE '      ~~~~~~~~         .""""`------.  `w---w`     `------------.        ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 29 COLUMN 1 VALUE 'source: https://asciiart.website/index.php?art=holiday/christmas/trees  ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
05 LINE 30 COLUMN 1 VALUE '                                                                        ' FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.

*> ***************************************************************
PROCEDURE DIVISION.
DISPLAY ZSCREEN
DISPLAY
 '*' AT LINE  12 COLUMN  29 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  13 COLUMN  28 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '@' AT LINE  13 COLUMN  30 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  13 COLUMN  49 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  13 COLUMN  66 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  14 COLUMN  29 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  14 COLUMN  32 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  14 COLUMN  47 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  14 COLUMN  68 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  15 COLUMN  26 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  15 COLUMN  28 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  15 COLUMN  30 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  16 COLUMN  25 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  16 COLUMN  28 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  16 COLUMN  32 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  17 COLUMN  24 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  17 COLUMN  27 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  17 COLUMN  31 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  17 COLUMN  34 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  18 COLUMN  23 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  18 COLUMN  26 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '@' AT LINE  18 COLUMN  29 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  18 COLUMN  33 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  19 COLUMN  22 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  19 COLUMN  25 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  19 COLUMN  28 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  19 COLUMN  31 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  19 COLUMN  34 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  19 COLUMN  36 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  20 COLUMN  8 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  20 COLUMN  21 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  20 COLUMN  24 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  20 COLUMN  27 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  20 COLUMN  30 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  20 COLUMN  34 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  20 COLUMN  36 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  21 COLUMN  20 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  21 COLUMN  23 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  21 COLUMN  26 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  21 COLUMN  29 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  21 COLUMN  32 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  21 COLUMN  35 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  21 COLUMN  37 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '@' AT LINE  22 COLUMN  19 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  22 COLUMN  22 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  22 COLUMN  24 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  22 COLUMN  27 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '@' AT LINE  22 COLUMN  30 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  22 COLUMN  33 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  22 COLUMN  37 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  22 COLUMN  39 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  23 COLUMN  21 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  23 COLUMN  26 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  23 COLUMN  29 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  23 COLUMN  31 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '@' AT LINE  23 COLUMN  34 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  23 COLUMN  38 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '*' AT LINE  23 COLUMN  40 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  24 COLUMN  19 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  24 COLUMN  21 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  24 COLUMN  23 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  24 COLUMN  28 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  24 COLUMN  31 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '@' AT LINE  24 COLUMN  34 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '0' AT LINE  24 COLUMN  38 WITH FOREGROUND-COLOR IS  WHITE   BACKGROUND-COLOR IS  GREEN   BLINK
 '@' AT LINE  24 COLUMN  41 WITH FOREGROUND-COLOR IS   BLUE   BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  25 COLUMN  18 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  25 COLUMN  20 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  25 COLUMN  22 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  25 COLUMN  24 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  26 COLUMN  19 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  26 COLUMN  21 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
 '*' AT LINE  26 COLUMN  23 WITH FOREGROUND-COLOR IS   RED    BACKGROUND-COLOR IS  WHITE   BLINK
.

ACCEPT ANYKEY END-ACCEPT
GOBACK.

END PROGRAM CHRISTMAS_2021.

