*> SCREENS: Accepting Colorized Fields into Woking Storage.
*> Source: https://github.com/soft9000/Blog9000/tree/master/GnuCOBOL/SCREEN
*>
IDENTIFICATION DIVISION.
PROGRAM-ID. EX_SCREEN_ACCEPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY WS_COLORS.

01 RESPONSE.
    05 WS-AUTHOR PIC X(50).
    05 WS-SOURCE PIC X(50).

SCREEN SECTION.
01 ZSCREEN.
    05 TAG-AUTHOR LINE 4 COLUMN 5 VALUE 'Author:' 
        FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
    05 AUTHOR-INPUT LINE 4 COLUMN 15 PIC X(50) 
        FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE
        TO WS-AUTHOR.

    05 TAG-SOURCE LINE 6 COLUMN 5 VALUE 'Source:' 
        FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE.
    05 SOURCE-INPUT LINE 6 COLUMN 15 PIC X(50) 
        FOREGROUND-COLOR GREEN BACKGROUND-COLOR WHITE
        TO WS-SOURCE.

*> ***************************************************************
PROCEDURE DIVISION.
DISPLAY ZSCREEN
DISPLAY
    ' Mighty Maxim ' AT LINE  1 COLUMN  2 
    WITH FOREGROUND-COLOR IS WHITE BACKGROUND-COLOR IS BLUE.

DISPLAY
    ' Tab TO Fields. Press ENTER when done. ' AT LINE 12 COLUMN 2
    WITH FOREGROUND-COLOR IS WHITE BACKGROUND-COLOR IS BLUE BLINK.
ACCEPT ZSCREEN END-ACCEPT.

GOBACK.

END PROGRAM EX_SCREEN_ACCEPT.

