       *> MM-SDF-RAW.cpy
        FD MM-COBOL-SDF-FILE IS EXTERNAL
        RECORD CONTAINS 355 CHARACTERS.
        01 Q-DATA-RAW.
           05 Q-SOURCE           PIC X(50).
           05 Q-AUTHOR           PIC X(50).
           05 Q-MIGHTY-MAXIM     PIC X(255).
           