IDENTIFICATION DIVISION.
PROGRAM-ID. BIG-CHARS.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "BIG_CHARS.cpy".

01 CHARS OCCURS 91 TIMES INDEXED BY SUBS.
   05 CHAR_NAME  PIC X.
   05 ZLINES PIC X(9) OCCURS 9 TIMES.

PROCEDURE DIVISION.
DISPLAY LINE_1 OF GLYPH_14.
DISPLAY LINE_2 OF GLYPH_14.
DISPLAY LINE_3 OF GLYPH_14.
DISPLAY LINE_4 OF GLYPH_14.
DISPLAY LINE_5 OF GLYPH_14.
DISPLAY LINE_6 OF GLYPH_14.
DISPLAY LINE_7 OF GLYPH_14.
DISPLAY LINE_8 OF GLYPH_14.
DISPLAY LINE_9 OF GLYPH_14.
