INIT_BIG_CHARS.
   MOVE CORR GLYPH_00 TO CHARS(1)
   MOVE CORR GLYPH_01 TO CHARS(2)
   MOVE CORR GLYPH_02 TO CHARS(3)
   MOVE CORR GLYPH_03 TO CHARS(4)
   MOVE CORR GLYPH_04 TO CHARS(5)
   MOVE CORR GLYPH_05 TO CHARS(6)
   MOVE CORR GLYPH_06 TO CHARS(7)
   MOVE CORR GLYPH_07 TO CHARS(8)
   MOVE CORR GLYPH_08 TO CHARS(9)
   MOVE CORR GLYPH_09 TO CHARS(10)
   MOVE CORR GLYPH_10 TO CHARS(11)
   MOVE CORR GLYPH_11 TO CHARS(12)
   MOVE CORR GLYPH_12 TO CHARS(13)
   MOVE CORR GLYPH_13 TO CHARS(14)
   MOVE CORR GLYPH_14 TO CHARS(15)
   MOVE CORR GLYPH_15 TO CHARS(16)
   MOVE CORR GLYPH_16 TO CHARS(17)
   MOVE CORR GLYPH_17 TO CHARS(18)
   MOVE CORR GLYPH_18 TO CHARS(19)
   MOVE CORR GLYPH_19 TO CHARS(20)
   MOVE CORR GLYPH_20 TO CHARS(21)
   MOVE CORR GLYPH_21 TO CHARS(22)
   MOVE CORR GLYPH_22 TO CHARS(23)
   MOVE CORR GLYPH_23 TO CHARS(24)
   MOVE CORR GLYPH_24 TO CHARS(25)
   MOVE CORR GLYPH_25 TO CHARS(26)
   MOVE CORR GLYPH_26 TO CHARS(27)
   MOVE CORR GLYPH_27 TO CHARS(28)
   MOVE CORR GLYPH_28 TO CHARS(29)
   MOVE CORR GLYPH_29 TO CHARS(30)
   MOVE CORR GLYPH_30 TO CHARS(31)
   MOVE CORR GLYPH_31 TO CHARS(32)
   MOVE CORR GLYPH_32 TO CHARS(33)
   MOVE CORR GLYPH_33 TO CHARS(34)
   MOVE CORR GLYPH_34 TO CHARS(35)
   MOVE CORR GLYPH_35 TO CHARS(36)
   MOVE CORR GLYPH_36 TO CHARS(37)
   MOVE CORR GLYPH_37 TO CHARS(38)
   MOVE CORR GLYPH_38 TO CHARS(39)
   MOVE CORR GLYPH_39 TO CHARS(40)
   MOVE CORR GLYPH_40 TO CHARS(41)
   MOVE CORR GLYPH_41 TO CHARS(42)
   MOVE CORR GLYPH_42 TO CHARS(43)
   MOVE CORR GLYPH_43 TO CHARS(44)
   MOVE CORR GLYPH_44 TO CHARS(45)
   MOVE CORR GLYPH_45 TO CHARS(46)
   MOVE CORR GLYPH_46 TO CHARS(47)
   MOVE CORR GLYPH_47 TO CHARS(48)
   MOVE CORR GLYPH_48 TO CHARS(49)
   MOVE CORR GLYPH_49 TO CHARS(50)
   MOVE CORR GLYPH_50 TO CHARS(51)
   MOVE CORR GLYPH_51 TO CHARS(52)
   MOVE CORR GLYPH_52 TO CHARS(53)
   MOVE CORR GLYPH_53 TO CHARS(54)
   MOVE CORR GLYPH_54 TO CHARS(55)
   MOVE CORR GLYPH_55 TO CHARS(56)
   MOVE CORR GLYPH_56 TO CHARS(57)
   MOVE CORR GLYPH_57 TO CHARS(58)
   MOVE CORR GLYPH_58 TO CHARS(59)
   MOVE CORR GLYPH_59 TO CHARS(60)
   MOVE CORR GLYPH_60 TO CHARS(61)
   MOVE CORR GLYPH_61 TO CHARS(62)
   MOVE CORR GLYPH_62 TO CHARS(63)
   MOVE CORR GLYPH_63 TO CHARS(64)
   MOVE CORR GLYPH_64 TO CHARS(65)
   MOVE CORR GLYPH_65 TO CHARS(66)
   MOVE CORR GLYPH_66 TO CHARS(67)
   MOVE CORR GLYPH_67 TO CHARS(68)
   MOVE CORR GLYPH_68 TO CHARS(69)
   MOVE CORR GLYPH_69 TO CHARS(70)
   MOVE CORR GLYPH_70 TO CHARS(71)
   MOVE CORR GLYPH_71 TO CHARS(72)
   MOVE CORR GLYPH_72 TO CHARS(73)
   MOVE CORR GLYPH_73 TO CHARS(74)
   MOVE CORR GLYPH_74 TO CHARS(75)
   MOVE CORR GLYPH_75 TO CHARS(76)
   MOVE CORR GLYPH_76 TO CHARS(77)
   MOVE CORR GLYPH_77 TO CHARS(78)
   MOVE CORR GLYPH_78 TO CHARS(79)
   MOVE CORR GLYPH_79 TO CHARS(80)
   MOVE CORR GLYPH_80 TO CHARS(81)
   MOVE CORR GLYPH_81 TO CHARS(82)
   MOVE CORR GLYPH_82 TO CHARS(83)
   MOVE CORR GLYPH_83 TO CHARS(84)
   MOVE CORR GLYPH_84 TO CHARS(85)
   MOVE CORR GLYPH_85 TO CHARS(86)
   MOVE CORR GLYPH_86 TO CHARS(87)
   MOVE CORR GLYPH_87 TO CHARS(88)
   MOVE CORR GLYPH_88 TO CHARS(89)
   MOVE CORR GLYPH_89 TO CHARS(90)
   MOVE CORR GLYPH_90 TO CHARS(91)
.
