IDENTIFICATION DIVISION.
PROGRAM-ID. BIG-CHARS.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "BIG_CHARS.cpy".

PROCEDURE DIVISION.
PERFORM INIT_BIG_CHARS.
MOVE 1 TO SUBS.
SEARCH CHARS 
    AT END DISPLAY 'DRAT!'
    WHEN '#' = CHAR_NAME OF CHARS(SUBS)
        DISPLAY LINE_1 OF CHARS(SUBS)
        DISPLAY LINE_2 OF CHARS(SUBS)
        DISPLAY LINE_3 OF CHARS(SUBS)
        DISPLAY LINE_4 OF CHARS(SUBS)
        DISPLAY LINE_5 OF CHARS(SUBS)
        DISPLAY LINE_6 OF CHARS(SUBS)
        DISPLAY LINE_7 OF CHARS(SUBS)
        DISPLAY LINE_8 OF CHARS(SUBS)
        DISPLAY LINE_9 OF CHARS(SUBS)
    END-SEARCH

GOBACK.

COPY "BIG_CHARS_PD.cpy".

END PROGRAM BIG-CHARS.
